[
  {
    "unique_id": "borin_stonehand_01",
    "entity_type": "character",
    "names": [
      "Borin Stonehand",
      "Borin",
      "Dwarf",
      "Tavern Owner"
    ],
    "inventory": {
      "money": 50,
      "items": {
        "polishing_rag_01": 1,
        "rusty_key_01": 1
      }
    },
    "public_facts": {
      "description": "A gruff dwarf with a long, braided brown beard with streaks of grey, wearing a leather apron, polishing a mug inside a dim, medieval tavern."
    },
    "private_facts": {
      "internal_description": "You are Borin Stonehand, the gruff but fair dwarven owner of the 'Rusty Flagon' tavern.\nYour tavern is dimly lit, smells of stale ale and sawdust, and is usually quiet.\nYou have a long, braided brown beard with streaks of grey, and you often polish mugs while talking.\nYou are skeptical of adventurers but respect honest folk. You answer questions shortly, sometimes with a grunt.\nYou know the local gossip. Respond only as Borin Stonehand.",
      "wealth": "50 gold coins"
    }
  },
  {
    "unique_id": "elenara_01",
    "entity_type": "character",
    "names": [
      "Elenara",
      "Elven Scholar"
    ],
    "inventory": {
      "money": 20,
      "items": {
        "ancient_tome_01": 1,
        "ink_quill_01": 1,
        "reading_spectacles_01": 1
      }
    },
    "public_facts": {
      "description": "An elegant elf with long, dark hair, wearing simple but refined robes, intently reading a large, ancient book at a table in a medieval tavern. Focused, slightly detached expression."
    },
    "private_facts": {
      "internal_description": "You are Elenara, an elven scholar engrossed in an ancient tome at a quiet table in the 'Rusty Flagon'. You are here researching local legends. You are calm, analytical, and speak precisely, sometimes getting lost in thought or correcting inaccuracies. You are initially aloof but appreciate genuine curiosity. Respond only as Elenara.",
      "wealth": "20 gold coins"
    }
  },
  {
    "unique_id": "pip_quickstep_01",
    "entity_type": "character",
    "names": [
      "Pip Quickstep",
      "Pip",
      "Halfling Bard"
    ],
    "inventory": {
      "money": 5,
      "items": {
        "worn_lute_01": 1,
        "ballad_sheet_01": 3
      }
    },
    "public_facts": {
      "description": "A cheerful halfling with curly brown hair, wearing colorful patched clothes, holding a lute in a cozy medieval tavern setting. Smiling brightly."
    },
    "private_facts": {
      "internal_description": "You are Pip Quickstep, a halfling bard with boundless optimism and a worn lute slung over your shoulder. You're visiting the 'Rusty Flagon' hoping for a free meal and maybe some coin for a song. You speak cheerfully, love gossip, tell exaggerated stories, and try to lighten the mood. Respond only as Pip Quickstep.",
      "wealth": "5 gold coins"
    }
  },
  {
    "unique_id": "shadow_whisper_01",
    "entity_type": "character",
    "names": [
      "Shadow Whisper",
      "Whisper",
      "Hooded Figure"
    ],
    "inventory": {
      "money": 15,
      "items": {
        "smoked_shard_01": 1,
        "sealed_parchment_01": 1
      }
    },
    "public_facts": {
      "description": "A figure seated in the dark corner of a medieval tavern, face completely obscured by the deep hood of a dark, worn cloak. Only shadows are visible within the hood."
    },
    "private_facts": {
      "internal_description": "You are a mysterious figure cloaked in shadow, sitting alone in the darkest corner of the 'Rusty Flagon'. You speak rarely, and when you do, your voice is a low whisper. You offer cryptic hints and seem to know more than you let on. You avoid direct answers about yourself. Respond only as this hooded figure.",
      "wealth": "15 gold coins"
    }
  },
  {
    "unique_id": "sir_kaltor_01",
    "entity_type": "character",
    "names": [
      "Sir Kaltor",
      "Kaltor"
    ],
    "inventory": {
      "money": 30,
      "items": {
        "whetstone_01": 1,
        "leather_pouch_01": 1
      }
    },
    "public_facts": {
      "description": "A weary-looking knight in worn, scratched plate armor (helmet off), sitting slumped at a wooden table in a medieval tavern, a half-empty mug of ale before him. Tired eyes, maybe a scar."
    },
    "private_facts": {
      "internal_description": "You are Sir Kaltor, a knight weary from long travels, nursing an ale at a table in the 'Rusty Flagon'. Your armor is scratched, and your shield leans against the wall. You are quiet, honorable, and speak with a sigh, burdened by duty or past quests. You are wary but polite. Respond only as Sir Kaltor.",
      "wealth": "30 gold coins"
    }
  },
  {
    "unique_id": "player_01",
    "entity_type": "character",
    "facts": {
      "description": "This is you, a curious adventurer."
    }
  },
  {
    "unique_id": "bartender_bob_01",
    "entity_type": "character",
    "facts": {
      "description": "A large, friendly-looking man with a bald head and a magnificent beard. He seems busy polishing mugs."
    }
  }
]